example/cavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
// {
//     p
//     {
//         solver          PETSc;          // 使用PETSc求解器
//         petsc_solver    cg;          // GMRES Krylov方法 (gmres, cg, bicgstab)  
//         preconditioner  ilu;            // ILU预处理器(GPU兼容，稳定可靠)
//         use_gpu         false;           // 启用GPU加速矩阵和向量
//         tolerance       1e-6;
//         relTol          0.01;
//         maxIter         1000;
//     }

//     U
//     {
//         solver          PETSc;
//         petsc_solver    bicgstab;       // BiCGSTAB对非对称矩阵效果好
//         preconditioner  ilu;            // ILU预处理器
//         tolerance       1e-6;
//         relTol          0.1;
//         maxIter         1000;
//     }

//     T
//     {
//         solver          PETSc;
//         petsc_solver    bicgstab;       // BiCGSTAB对非对称矩阵效果好
//         preconditioner  ilu;            // ILU预处理器
//         tolerance       1e-6;
//         relTol          0.1;
//         maxIter         1000;
//     }
// }

// 传统求解器配置（备选）
// solvers_backup
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        DILU;
        tolerance       1e-05;
        relTol          0;
    }

    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors 
{ 
    fields 
    { 
        p               0.3; 
    } 
    equations 
    { 
        U               0.7;
        T               0.7;
    } 
} 

// ************************************************************************* //
